#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [5]:
a = [4,8,15,16,23,42]

In [6]:
pd.Series(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [13]:
b = [1,2,3,4,5,6,7,8,9,10]

In [14]:
pd.Series(b)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [15]:
data = {'Name' : ['Alice', 'Bob', 'Claire'],
       'Age':[25, 30, 27],
       'Gender':['Female', 'Male', 'Female']}

In [16]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional tabular data structure that consists of rows and columns. It can be seen as a collection of Pandas Series objects, where each column represents a Series. A DataFrame allows you to store and manipulate data in a structured and organized manner.

On the other hand, a Pandas Series is a one-dimensional labeled array that can store data of any type (numeric, string, boolean, etc.). It is similar to a column in a spreadsheet or a single variable in a dataset.

In [17]:
# Example of Series

data = {'Name' : ['Alice', 'Bob', 'Claire'],
       'Age':[25, 30, 27],
       'Gender':['Female', 'Male', 'Female']}

In [18]:
pd.Series(data)

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

In [19]:
type(pd.Series(data))

pandas.core.series.Series

In [21]:
# Example of DataFrame


data = {'Name' : ['Alice', 'Bob', 'Claire'],
       'Age':[25, 30, 27],
       'Gender':['Female', 'Male', 'Female']}

In [22]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [23]:
type(pd.DataFrame(data))

pandas.core.frame.DataFrame

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [8]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

Example of some Common functions

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [12]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [17]:
df[['Name']]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among the options given (Series, DataFrame, Panel), both Series and DataFrame are mutable in nature, whereas Panel is not mutable.

In Pandas, a mutable object is one that can be modified after its creation. Here's a breakdown of the mutability of the three options:

Series: Mutable

A Pandas Series can be modified after creation by assigning new values to specific indices or by applying functions that modify the values in-place.
DataFrame: Mutable

A Pandas DataFrame is mutable and can be modified after creation. You can add or remove columns, change the values in cells, update rows, and perform various operations that modify the DataFrame.
Panel: Not mutable

The Panel data structure in Pandas has been deprecated and is no longer recommended for use. However, it is worth noting that even when it was available, Panel was not mutable. It was a three-dimensional data structure with items, major_axis, and minor_axis, but it did not support in-place modifications.
To summarize, Series and DataFrame are mutable in nature and can be modified after creation, while Panel is not mutable and has been deprecated in recent versions of Pandas.

### Create a DataFrame using multiple Series. Explain with an example.

In [18]:
names = pd.Series(['Alice', 'Bob', 'Claire'])
ages = pd.Series([25, 30, 27])
genders = pd.Series(['Female', 'Male', 'Female'])

In [20]:
data = {
    'Name': names,
    'Age': ages,
    'Gender': genders }

In [21]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female